Ran Plan for project: `agribusiness-dev-app-billing-sqs` dir: `accounts/agribusiness-dev/sa-east-1/app/billing-sqs` workspace: `default`

<details><summary>Show Output</summary>

```diff
time=2026-01-29T04:47:22Z level=info msg=Downloading Terraform configurations from file:///home/atlantis/.atlantis/repos/wiliscavalcante/atlantis-terragrunt-poc/2/default/modules/sqs into /home/atlantis/.atlantis/repos/wiliscavalcante/atlantis-terragrunt-poc/2/default/accounts/agribusiness-dev/sa-east-1/app/billing-sqs/.terragrunt-cache/vDO1i1hwOoPtH_WuYzi3h1jmd50/9VlJ743O9OlrX5p8RgxQm8umC50

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.30.0...
- Installed hashicorp/aws v6.30.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m


[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v6.30.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_sqs_queue.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_sqs_queue" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mcontent_based_deduplication[0m[0m       = false
      [32m+[0m [0m[1m[0mdeduplication_scope[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdelay_seconds[0m[0m                     = 0
      [32m+[0m [0m[1m[0mfifo_queue[0m[0m                        = false
      [32m+[0m [0m[1m[0mfifo_throughput_limit[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkms_data_key_reuse_period_seconds[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmax_message_size[0m[0m                  = 262144
      [32m+[0m [0m[1m[0mmessage_retention_seconds[0m[0m         = 345600
      [32m+[0m [0m[1m[0mname[0m[0m                              = "example-org-agribusiness-dev-dev-app-billing-sqs"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mreceive_wait_time_seconds[0m[0m         = 0
      [32m+[0m [0m[1m[0mredrive_allow_policy[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mredrive_policy[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                            = "sa-east-1"
      [32m+[0m [0m[1m[0msqs_managed_sse_enabled[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                              = {
          [32m+[0m [0m"Product" = "billing"
          [32m+[0m [0m"Team"    = "payments"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                          = {
          [32m+[0m [0m"Product" = "billing"
          [32m+[0m [0m"Team"    = "payments"
        }
      [32m+[0m [0m[1m[0murl[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mvisibility_timeout_seconds[0m[0m        = 40
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mqueue_arn[0m[0m  = (known after apply)
  [32m+[0m [0m[1m[0mqueue_name[0m[0m = "example-org-agribusiness-dev-dev-app-billing-sqs"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p agribusiness-dev-app-billing-sqs`
* :put_litter_in_its_place: To **delete** this plan click [here](http://47ad46d112da:4141/lock?id=wiliscavalcante%252Fatlantis-terragrunt-poc%252Faccounts%252Fagribusiness-dev%252Fsa-east-1%252Fapp%252Fbilling-sqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p agribusiness-dev-app-billing-sqs`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
